-- ./app/platform/room/new_view/settings_view.lua
require 'app.platform.room.new_view.loading'

local text_private = [[
隐私政策
引言 
您在使用我们的服务时，我们可能会收集和使用您的相关信息。我们希望通过本《隐私政策》向您说明，在使用我们的服务时，我们如何收集、使用、储存和分享这些信息，以及我们为您提供的访问、更新、控制和保护这些信息的方式。本《隐私政策》与您所使用的服务息息相关，希望您仔细阅读，在需要时，按照本《隐私政策》的指引，作出您认为适当的选择。本《隐私政策》中涉及的相关技术词汇，我们尽量以简明扼要的表述，并提供进一步说明的链接，以便您的理解。
您使用或继续使用我们的服务，即意味着同意我们按照本《隐私政策》收集、使用、储存和分享您的相关信息。
如对本《隐私政策》或相关事宜有任何问题，请通过客服与我们联系。
我们可能收集的信息
我们提供服务时，可能会收集、储存和使用下列与您有关的信息。如果您不提供相关信息，可能无法注册成为我们的用户或无法享受我们提供的某些服务，或者无法达到相关服务拟达到的效果。
您提供的信息
您在注册账户或使用我们的服务时，向我们提供的相关个人信息，例如微信账号、手机或住址等；
您通过我们的服务向其他方提供的共享信息，以及您使用我们的服务时所储存的信息。
其他方分享的您的信息
其他方使用我们的服务时所提供有关您的共享信息。
我们获取的您的信息
您使用服务时我们可能收集如下信息：
日志信息，指您使用我们的服务时，系统可能通过cookies、web beacon或其他方式自动采集的技术信息，包括：
设备或软件信息，例如您的移动设备、网页浏览器或用于接入我们服务的其他程序所提供的配置信息、您的IP地址和移动设备所用的版本和设备识别码；
在使用我们服务时搜索或浏览的信息，例如您使用的网页搜索词语、访问的社交媒体页面url地址，以及您在使用我们服务时浏览或要求提供的其他信息和内容详情；
有关您曾使用的移动应用（APP）和其他软件的信息，以及您曾经使用该等移动应用和软件的信息；
您通过我们的服务进行通讯的信息，例如曾通讯的账号，以及通讯时间、数据和时长；
您通过我们的服务分享的内容所包含的信息（元数据），例如拍摄或上传的共享照片或录像的日期、时间或地点等。
位置信息，指您开启设备定位功能并使用我们基于位置提供的相关服务时，收集的有关您位置的信息，包括：
您通过具有定位功能的移动设备使用我们的服务时，通过GPS或WiFi等方式收集的您的地理位置信息；
您或其他用户提供的包含您所处地理位置的实时信息，例如您提供的账户信息中包含的您所在地区信息，您或其他人上传的显示您当前或曾经所处地理位置的共享信息，您或其他人共享的照片包含的地理标记信息；
您可以通过关闭定位功能，停止对您的地理位置信息的收集。
我们可能如何使用信息
我们可能将在向您提供服务的过程之中所收集的信息用作下列用途：
向您提供服务；
在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性；
帮助我们设计新服务，改善我们现有服务；
使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，例如语言设定、位置设定、个性化的帮助服务和指示，或对您和其他用户作出其他方面的回应；
向您提供与您更加相关的广告以替代普遍投放的广告；
评估我们服务中的广告和其他促销及推广活动的效果，并加以改善；
软件认证或管理软件升级；
让您参与有关我们产品和服务的调查。
为了让您有更好的体验、改善我们的服务或您同意的其他用途，在符合相关法律法规的前提下，我们可能将通过某一项服务所收集的信息，以汇集信息或者个性化的方式，用于我们的其他服务。例如，在您使用我们的一项服务时所收集的信息，可能在另一服务中用于向您提供特定内容，或向您展示与您相关的、非普遍推送的信息。如果我们在相关服务中提供了相应选项，您也可以授权我们将该服务所提供和储存的信息用于我们的其他服务。
您如何访问和控制自己的个人信息
我们将尽一切可能采取适当的技术手段，保证您可以访问、更新和更正自己的注册信息或使用我们的服务时提供的其他个人信息。在访问、更新、更正和删除前述信息时，我们可能会要求您进行身份验证，以保障账户安全。
我们可能分享的信息
除以下情形外，未经您同意，我们以及我们的关联公司不会与任何第三方分享您的个人信息：
我们以及我们的关联公司，可能将您的个人信息与我们的关联公司、合作伙伴及第三方服务供应商、承包商及代理（例如代表我们发出电子邮件或推送通知的通讯服务提供商、为我们提供位置数据的地图服务供应商）分享（他们可能并非位于您所在的法域），用作下列用途：
向您提供我们的服务；
实现“我们可能如何使用信息”部分所述目的；
履行我们在《服务协议》或本《隐私政策》中的义务和行使我们的权利；
理解、维护和改善我们的服务。
如我们或我们的关联公司与任何上述第三方分享您的个人信息，我们将努力确保该等第三方在使用您的个人信息时遵守本《隐私政策》及我们要求其遵守的其他适当的保密和安全措施。
随着我们业务的持续发展，我们以及我们的关联公司有可能进行合并、收购、资产转让或类似的交易，您的个人信息有可能作为此类交易的一部分而被转移。我们将在转移前通知您。
我们或我们的关联公司还可能为以下需要而保留、保存或披露您的个人信息：
遵守适用的法律法规；
遵守法院命令或其他法律程序的规定；
遵守相关政府机关的要求；
为遵守适用的法律法规、维护社会公共利益，或保护我们的客户、我们或我们的集团公司、其他用户或雇员的人身和财产安全或合法权益所合理必需的用途。
信息安全
我们仅在本《隐私政策》所述目的所必需的期间和法律法规要求的时限内保留您的个人信息。
我们使用各种安全技术和程序，以防信息的丢失、不当使用、未经授权阅览或披露。例如，在某些服务中，我们将利用加密技术（例如SSL）来保护您提供的个人信息。但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。
您分享的信息
我们的多项服务，可让您不仅与自己的社交网络，也与使用该服务的所有用户公开分享您的相关信息，例如，您在我们的服务中所上传或发布的信息（包括您公开的个人信息、您建立的名单）、您对其他人上传或发布的信息作出的回应，以及包括与这些信息有关的位置数据和日志信息。使用我们服务的其他用户也有可能分享与您有关的信息（包括位置数据和日志信息）。特别是，我们的社交媒体服务，是专为使您与世界各地的用户共享信息而设计，您可以使共享信息实时、广泛地传递。只要您不删除共享信息，有关信息会一直留存在公共领域；即使您删除共享信息，有关信息仍可能由其他用户或不受我们控制的非关联第三方独立地缓存、复制或储存，或由其他用户或该等第三方在公共领域保存。
因此，请您谨慎考虑通过我们的服务上传、发布和交流的信息内容。在一些情况下，您可通过我们某些服务的隐私设定来控制有权浏览您共享信息的用户范围。如要求从我们的服务中删除您的相关信息，请通过该等特别服务条款提供的方式操作。
您分享的敏感个人信息
某些个人信息因其特殊性可能被认为是敏感个人信息，例如您的种族、宗教、个人健康和医疗信息等。相比其他个人信息，敏感个人信息受到更加严格的保护。
请注意，您在使用我们的服务时所提供、上传或发布的内容和信息（例如有关您社交活动的照片等信息），可能会泄露您的敏感个人信息。您需要谨慎地考虑，是否在使用我们的服务时披露相关敏感个人信息。
您同意按本《隐私政策》所述的目的和方式来处理您的敏感个人信息。
我们可能如何收集信息
我们或我们的第三方合作伙伴，可能通过cookies和web beacon收集和使用您的信息，并将该等信息储存为日志信息。
我们使用自己的cookies和web beacon，目的是为您提供更个性化的用户体验和服务，并用于以下用途：
记住您的身份。例如：cookies和web beacon有助于我们辨认您作为我们的注册用户的身份，或保存您向我们提供的有关您的喜好或其他信息；
分析您使用我们服务的情况。例如，我们可利用cookies和web beacon来了解您使用我们的服务进行什么活动，或哪些网页或服务最受您的欢迎；
广告优化。Cookies和web beacon有助于我们根据您的信息，向您提供与您相关的广告而非进行普遍的广告投放。
我们为上述目的使用cookies和web beacon的同时，可能将通过cookies和web beacon收集的非个人身份信息，经统计加工后提供给广告商或其他合作伙伴，用于分析用户如何使用我们的服务，并用于广告服务。
我们的产品和服务上可能会有广告商或其他合作方放置的cookies和web beacon。这些cookies和web beacon可能会收集与您相关的非个人身份信息，以用于分析用户如何使用该等服务、向您发送您可能感兴趣的广告，或用于评估广告服务的效果。这些第三方cookies和web beacon收集和使用该等信息，不受本《隐私政策》约束，而是受相关使用者的隐私政策约束，我们不对第三方的cookies或web beacon承担责任。
您可以通过浏览器设置拒绝或管理cookies或web beacon。但请注意，如果停用cookies或web beacon，您有可能无法享受最佳的服务体验，某些服务也可能无法正常使用。同时，您还会收到同样数量的广告，但这些广告与您的相关性会降低。
广告服务
我们可能使用您的相关信息，向您提供与您更加相关的广告。
我们也可能使用您的信息，通过我们的服务、电子邮件或其他方式向您发送营销信息，提供或推广我们或第三方的如下商品和服务：
我们的商品或服务，我们的关联公司和合作伙伴的商品或服务，包括即时通讯服务、网上媒体服务、互动娱乐服务、社交网络服务、付款服务、互联网搜索服务、位置和地图服务、应用软件和服务、数据管理软件和服务、网上广告服务、互联网金融，以及其他社交媒体、娱乐、电子商务、资讯和通讯软件或服务（统称“互联网服务”）；
第三方互联网服务供应商，以及与下列有关的第三方商品或服务：食物和餐饮、体育、音乐、电影、电视、现场表演及其他艺术和娱乐、书册、杂志和其他刊物、服装和配饰、珠宝、化妆品、个人健康和卫生、电子、收藏品、家用器皿、电器、家居装饰和摆设、宠物、汽车、酒店、交通和旅游、银行、保险及其他金融服务、会员积分和奖励计划，以及我们认为可能与您相关的其他商品或服务。
如您不希望我们将您的个人信息用作前述广告用途，您可以通过我们在广告中提供的相关提示，或在特定服务中提供的指引，要求我们停止为上述用途使用您的个人信息。
我们可能向您发送的邮件和信息
邮件和信息推送
您在使用我们的服务时，我们可能使用您的信息向您的设备发送电子邮件、新闻或推送通知。如您不希望收到这些信息，可以按照我们的相关提示，在设备上选择取消订阅。
与服务有关的公告
我们可能在必要时（例如因系统维护而暂停某一项服务时）向您发出与服务有关的公告。您可能无法取消这些与服务有关、性质不属于推广的公告。
隐私政策的适用例外
我们的服务可能包括或链接至第三方提供的社交媒体或其他服务（包括网站）。例如：
您利用 “分享”键将某些内容分享到我们的服务，或您利用第三方连线服务登录我们的服务。这些功能可能会收集您的相关信息（包括您的日志信息），并可能在您的电脑装置cookies，从而正常运行上述功能；
我们通过广告或我们服务的其他方式向您提供链接，使您可以接入第三方的服务或网站。
该等第三方社交媒体或其他服务可能由相关的第三方或我们运营。您使用该等第三方的社交媒体服务或其他服务（包括您向该等第三方提供的任何个人信息），须受该第三方的服务条款及隐私政策（而非《通用服务条款》或本《隐私政策》）约束，您需要仔细阅读其条款。本《隐私政策》仅适用于我们所收集的信息，并不适用于任何第三方提供的服务或第三方的信息使用规则，我们对任何第三方使用由您提供的信息不承担任何责任。
未成年人使用我们的服务
我们鼓励父母或监护人指导未满十八岁的未成年人使用我们的服务。我们建议未成年人鼓励他们的父母或监护人阅读本《隐私政策》，并建议未成年人在提交的个人信息之前寻求父母或监护人的同意和指导。
隐私政策的适用范围
除某些特定服务外，我们所有的服务均适用本《隐私政策》。这些特定服务将适用特定的隐私政策。针对某些特定服务的特定隐私政策，将更具体地说明我们在该等服务中如何使用您的信息。该特定服务的隐私政策构成本《隐私政策》的一部分。如相关特定服务的隐私政策与本《隐私政策》有不一致之处，适用该特定服务的隐私政策。
除本《隐私政策》另有规定外，本《隐私条款》所用词语将与《服务协议》所定义的词语具有相同的涵义。
请您注意，本《隐私政策》不适用于以下情况：
通过我们的服务而接入的第三方服务（包括任何第三方网站）收集的信息；
通过在我们服务中进行广告服务的其他公司或机构所收集的信息。
变更
我们可能适时修订本《隐私政策》的条款，该等修订构成本《隐私政策》的一部分。如该等修订造成您在本《隐私政策》下权利的实质减少，我们将在修订生效前通过在主页上显著位置提示或向您发送电子邮件或以其他方式通知您。在该种情况下，若您继续使用我们的服务，即表示同意受经修订的本《隐私政策》的约束。
]]

local text_service = [[
游戏许可及服务协议
《游戏许可及服务协议》（以下简称“本协议”）由您与游戏服务提供方共同缔结，本协议具有合同效力。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款，以及开通或使用某项服务的单独协议。限制、免责条款可能以黑体加粗形式提示您注意。
除非您已阅读并接受本协议所有条款，否则您无权使用游戏服务。您使用游戏服务即视为您已阅读并同意签署本协议。
如果您未满18周岁，请在法定监护人的陪同下阅读本协议，并特别注意未成年人使用条款。
一、【定义】
1.1?本协议：指本协议正文、《服务协议》、游戏规则及其修订版本。上述内容一经正式发布，即为本协议不可分割的组成部分。本协议同时还包括文化部根据《网络游戏管理暂行办法》（文化部令第49号）制定的《网络游戏服务格式化协议必备条款》。
1.2?游戏规则：指游戏服务提供方不时发布并修订的关于游戏的用户守则、玩家条例、游戏公告及通知等内容。
1.3?游戏服务提供方：指向您提供游戏及其服务的深圳市大川网络科技有限公司，在本协议中简称为“大川”。
1.4?游戏：指由负责运营的游戏的统称，包括计算机客户端游戏、网页游戏、移动终端游戏等形式的游戏；游戏可能以软件形式提供，这种情况下，游戏还包括该相关软件及相关文档。
1.5?游戏服务：指向您提供的与游戏相关的各项在线运营服务。
1.6?您：又称“玩家”或“用户”，指被授权使用游戏及其服务的自然人。
1.7?游戏数据：指您在使用游戏过程中产生的被服务器记录的各种数据，包括游戏日志、安全日志等数据。
二、【协议的变更和生效】
2.1 有权在必要时变更本协议条款，并在相关页面进行通知。您可以在游戏的相关页面查阅最新版本的协议条款。
2.2 本协议条款变更后，如果您继续使用游戏服务，即视为您已接受变更后的协议。如果您不接受变更后的协议，应当停止使用游戏服务。
三、【游戏账号】
3.1 您如果需要使用和享受游戏，则您需要将您享有使用权的微信账号作为游戏账号，并按照《网络游戏管理暂行规定》及文化部《网络游戏服务格式化协议必备条款》的要求，登录实名注册系统并进行实名注册。您对该微信账号的申请、使用等行为应符合不时修订并公布的《服务协议》、《微信软件许可及服务协议》的规范。
3.2?您充分理解并同意：会按照国家相关要求将您的实名注册信息运用于防沉迷系统之中，即可能会根据您的实名注册信息判断您是否年满18周岁，从而决定是否对您的游戏账号予以防沉迷限制。
3.3?您应妥善保管您的游戏账号，包括妥善保管您游戏账号所对应的微信账号及密码；您应在知晓您的游戏账号被盗用后第一时间通知。
3.4?您充分理解并同意，为提高游戏服务的安全水平，有权将有关技术或软件应用到游戏中，但不保证这些安全保障措施可以完全杜绝游戏账号被他人窃取或丢失的风险。
3.5?您充分理解并同意，若依照相关业务规则限制、冻结或终止您的微信账号的使用，可能会导致您游戏账号下游戏数据及相关信息被删除，以及相关权益的丧失，该损失由您自行承担，对此不承担任何责任。
3.6?您充分理解并同意，为高效利用服务器资源，如果您长期未使用游戏账号登录游戏，有权视需要，在提前通知的情况下，对该账号及其账号下的游戏数据及相关信息采取删除等处置措施，上述处置可能导致您对该游戏账号下相关权益的丧失，对此不承担任何责任。
四、【用户信息收集、使用及保护】
4.1 您同意并授权为履行本协议之目的收集您的用户信息，这些信息包括您在实名注册系统中注册的信息、您游戏账号下的游戏数据以及其他您在使用游戏服务的过程中向提供或基于安全、用户体验优化等考虑而需收集的信息，对您的用户信息的收集将遵循相关法律的规定。
4.2?您充分理解并同意：为更好地向您提供游戏服务，可以将您的用户信息提交给其关联公司，且有权自行或通过第三方对您的用户信息进行整理、统计、分析及利用。
4.3?您充分理解并同意：或其合作的第三方可以根据您的用户信息，通过短信、电话、邮件等各种方式向您提供关于游戏的活动信息、推广信息等各类信息。
4.4 保证不对外公开或向任何第三方提供您的个人信息，但是存在下列情形之一的除外：
（1）公开或提供相关信息之前获得您许可的；
（2）根据法律或政策的规定而公开或提供的；
（3）只有公开或提供您的个人信息，才能提供您需要的游戏服务的；
（4）根据国家权力机关要求公开或提供的；
（5）根据本协议其他条款约定而公开或提供的。
五、【游戏服务】
5.1 在您遵守本协议及相关法律法规的前提下，给予您一项个人的、不可转让及非排他性的许可，以使用游戏服务。您仅可为非商业目的使用游戏服务，包括：
（1）接收、下载、安装、启动、升级、登录、显示、运行和/或截屏游戏；
（2）查阅游戏规则、用户个人资料、游戏对局结果，开设游戏房间、设置游戏参数，在游戏中购买、使用游戏道具、等，使用聊天功能、社交分享功能；
（3）使用游戏支持并允许的其他某一项或几项功能。
5.2?您在使用游戏服务过程中不得未经许可以任何方式录制并向他人传播游戏内容，包括不得利用任何第三方软件进行网络传播等。
5.3 在游戏以软件形式提供的情况下，您在使用游戏及游戏服务时还应符合本协议第六条关于软件许可的规定。
5.4 本条及本协议其他条款未明示授权的其他一切权利仍由保留，您在行使这些权利时须另外取得的书面许可。
5.5 如果发现或收到他人举报或投诉用户违反本协议约定的，有权不经通知随时对相关内容进行删除，并视行为情节对违规游戏账号处以包括但不限于警告、限制或禁止使用全部或部分功能、游戏账号封禁直至注销的处罚，并公告处理结果。
5.6 您充分理解并同意，有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应独自承担由此而产生的一切法律责任。
5.7 您充分理解并同意，因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任；因此遭受损失的，您也应当一并赔偿。
5.8?您充分理解并同意：游戏道具、游戏装备、游戏币等是游戏服务的一部分，在此许可您依本协议而获得其使用权。您购买、使用游戏道具、游戏装备、游戏币等应遵循本协议、游戏具体规则的要求；同时，游戏道具、游戏装备、游戏币等可能受到一定有效期限的限制，若您在规定的有效期内未使用，除不可抗力或可归责于的原因外，一旦有效期届满，将会自动失效。
5.9?您充分理解并同意：为营造公平、健康的游戏环境，在您使用游戏服务的过程中，有权通过技术手段了解您终端设备的随机存储内存以及与游戏同时运行的相关程序。一经发现有任何未经授权的、危害游戏服务正常运营的相关程序，将收集所有与此有关的信息并采取合理措施予以打击。
5.10 您充分理解并同意：为了保证您及其他用户的游戏速度，有权定期转移或者清除游戏服务器上存储的一些过往的游戏数据。
5.11 将按照相关法律法规和本协议的规定，采取切实有效的措施保护未成年人在使用游戏服务过程中的合法权益，包括可能采取技术措施、禁止未成年人接触不适宜的游戏或者游戏功能、限制未成年人的游戏时间、预防未成年人沉迷网络。作为游戏规则的一部分，还将在适当位置发布游戏用户指引和警示说明，包括游戏内容介绍、正确使用游戏的方法以及防止危害发生的方法。所有未成年人用户都应在法定监护人的指导下仔细阅读并遵照执行这些指引和说明；其他玩家在使用游戏服务的过程中应避免发布、产生任何有损未成年人身心健康的内容，共同营造健康游戏环境。
六、【软件许可】
6.1 使用游戏服务可能需要下载并安装相关软件，您可以直接从的相关网站上获取该软件，也可以从得到授权的第三方获取。如果您从未经授权的第三方获取游戏或与游戏名称相同的游戏，将视为您未获得授权，无法保证该游戏能够正常使用，并对因此给您造成的损失不予负责。
6.2?可能为不同的终端设备或操作系统开发了不同的软件版本，包括但不限于windows、ios、android、windows phone、symbian、blackberry等多个应用版本，您应当根据实际情况选择下载合适的版本进行安装，下载安装程序后，您需要按照该程序提示的步骤正确安装。
6.3?若游戏以软件形式提供，给予您一项个人的、不可转让及非排他性的许可。您仅可为非商业目的在单一台终端设备上下载、安装、登录、使用该游戏。
6.4 为提供更加优质、安全的服务，在软件安装时可能推荐您安装其他软件，您可以选择安装或不安装。
6.5 如果您不再需要使用该软件或者需要安装新版，可以自行卸载。如果您愿意帮助改进产品服务，请告知卸载的原因。
6.6 为了保证游戏服务的安全性和功能的一致性，有权不经向您特别通知而对软件进行更新，或者对软件的部分功能效果进行改变或限制。
6.7 软件新版本发布后，旧版本的软件可能无法使用。不保证旧版本软件继续可用及相应的客户服务，请您随时核对并下载最新版本。
七、【用户行为规范】
7.1 您充分了解并同意，您必须为自己游戏账号下的一切行为负责，包括您所发表的任何内容以及由此产生的任何后果。您应对游戏中的内容自行加以判断，并承担因使用游戏服务而引起的所有风险，包括因对游戏内容的正确性、完整性或实用性的依赖而产生的风险。无法且不会对因前述风险而导致的任何损失或损害承担责任。
7.2 您除了可以按照本协议的约定使用游戏服务之外，不得进行任何侵犯游戏的知识产权的行为，或者进行其他的有损于或其他第三方合法权益的行为。
7.3 除非法律允许或书面许可，您不得从事下列行为：
（1）删除游戏软件及其副本上关于著作权的信息；
（2）对游戏软件进行反向工程、反向汇编、反向编译或者以其他方式尝试发现软件的源代码；
（3）对游戏软件进行扫描、探查、测试，以检测、发现、查找其中可能存在的BUG或弱点；
（4）对游戏软件或者软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经合法授权的第三方工具/服务接入软件和相关系统；
（5）修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论上述行为是否为商业目的；
（6）通过非开发、授权的第三方软件、插件、外挂、系统，使用游戏及游戏服务，或制作、发布、传播非开发、授权的第三方软件、插件、外挂、系统；
（7）对游戏中拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；
（8）建立有关游戏的镜像站点，或者进行网页（络）快照，或者利用架设服务器等方式，为他人提供与游戏服务完全相同或者类似的服务；
（9）将游戏的任意部分分离出来单独使用，或者进行其他的不符合本协议的使用；
（10）使用游戏的名称、商标或其它知识产权；
（11）其他未经明示授权的行为。
7.4 您在使用游戏服务过程中有如下行为的，将视情节严重程度，依据本协议及相关游戏规则的规定，对您做出暂时或永久性地禁止登录、删除游戏账号及游戏数据、删除相关信息等处理措施，情节严重的将移交有关行政管理机关给予行政处罚，或者追究您的刑事责任：
（1）以某种方式暗示或伪称内部员工或某种特殊身份，企图得到不正当利益或影响其他用户权益的行为；
（2）在游戏中使用非法或不当词语、字符等，包括用于角色命名；
（3）以任何方式破坏游戏或影响游戏服务的正常进行；
（4）各种非法外挂行为；
（5）传播非法言论或不当信息；
（6）盗取他人游戏账号、游戏物品；
（7）私自进行游戏账号交易；
（8）私自进行游戏道具、游戏装备、游戏币等交易；
（9）其他在行业内被广泛认可的不当行为，无论是否已经被本协议或游戏规则明确列明。
八、【免责声明】
8.1 游戏服务以“现状”提供给您。不保证：游戏服务无错误及不会中断、所有缺陷已被更正、或游戏服务不会受到病毒或任何其它因素的损害。除非有法律明确规定，在此明确声明不承担任何明示或默示的担保责任，包括但不限于对游戏服务的性能、适用性或不侵权的担保。
8.2 在任何情况下，不对因不可抗力导致的您在使用游戏服务过程中遭受的损失承担责任。该等不可抗力事件包括但不限于国家法律、法规、政策及国家机关的命令或者其它的诸如地震、水灾、雪灾、火灾、海啸、台风、罢工、战争等不可预测、不可避免且不可克服的事件。
8.3可独立决定随时变更、终止、中止您对任何游戏服务的使用，无须向您发出任何提前通知，但根据法律法规规定或您与的约定需要提前通知的除外。若因您的行为违反法律法规的规定或本协议的规定，根据相关规定终止、中止您使用任何游戏服务，则无须向您承担任何责任，且有权要求您承担相应的责任。
8.4?游戏可能因游戏软件BUG、版本更新缺陷、第三方病毒攻击或其他任何因素导致您的游戏角色、游戏道具、游戏装备及游戏币等账号数据发生异常。在数据异常的原因未得到查明前，有权暂时冻结该游戏账号；若查明数据异常为非正常游戏行为，有权恢复游戏账号数据至异常发生前的原始状态（包括向第三方追回被转移数据），且无须向您承担任何责任。
8.5?未授权您从任何第三方通过购买、接受赠与或者其他的方式获得游戏账号、游戏道具、游戏装备、游戏币等，不对第三方交易的行为负责，并且不受理因任何第三方交易发生纠纷而带来的申诉。
8.6?您充分理解到：第三方在游戏中投放的广告、链接或者其它形式的推广内容，均是由其自行提供的，您应当自行判断其真实性，对其推广内容不作任何明示或者默示的担保。
8.7?您充分理解到：不同操作系统之间存在不互通的客观情况，该客观情况并非造成，由此可能导致您在某一操作系统中的充值和游戏数据不能顺利转移到另一操作系统中。由于您在不同系统进行切换造成的充值损失和游戏数据丢失风险应由您自行承担，不得要求承担任何责任。
8.8?您充分理解到：游戏中可能会设置强制对战区域或玩法，如果您不同意强制对战，请您不要进入该游戏或游戏区域；您的进入，将被视为同意该玩法并接受相应后果。
九、【知识产权】
9.1 大川是游戏的知识产权权利人。游戏的一切著作权、商标权、专利权、商业秘密等知识产权，以及与游戏相关的所有信息内容（包括文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等）均受中华人民共和国法律法规和相应的国际条约保护，享有上述知识产权，但相关权利人依照法律规定应享有的权利除外。
9.2 您在使用游戏服务中产生的游戏数据的所有权和知识产权归所有，有权处置该游戏数据。
9.3 游戏可能涉及第三方知识产权，而该等第三方对您基于本协议在游戏中使用该等知识产权有要求的，将以适当方式向您告知该要求，您应当一并遵守。
十、【遵守当地法律监管】
10.1 您在使用游戏服务过程中应当遵守当地相关的法律法规，并尊重当地的道德和风俗习惯。如果您的行为违反了当地法律法规或道德风俗，您应当为此独立承担责任。
10.2 您应避免因使用游戏服务而使卷入政治和公共事件，否则有权暂停或终止对您的服务。
十一、【隐私政策】
保护用户个人信息及隐私是的一项基本原则。除本协议另有规定外，游戏服务将遵循统一公布的相关隐私政策。
十二、【管辖与法律适用】
12.1?本协议签订地为中华人民共和国广东省深圳市南山区。
12.2?本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。
12.3?若您和之间因本协议发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交至本协议签订地有管辖权的人民法院管辖。
12.4 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。
12.5 本协议条款无论因何种原因部分无效，其余条款仍有效，对各方具有约束力。
十三、【其他】
13.1 根据国家新闻出版总署关于健康游戏的忠告，提醒您：抵制不良游戏，拒绝盗版游戏；注意自我保护，谨防受骗上当；适度游戏益脑，沉迷游戏伤身。
13.2 如果您对本协议或游戏服务有意见或建议，可与客户服务部门联系，我们会给予您必要的帮助。
大川网络科技有限公司
]]

local m_clientmain = require 'app.platform.room.clientmain'

local popup_base = require 'app.platform.common.popup_base'
local SettingsView = class('SettingsView', popup_base)
function SettingsView:ctor(scene_instance, args, show_anim_func, hide_anim_func)
    self.csb_file = 'hall_res/common/settings_view.csb'

    popup_base.ctor(self, scene_instance, args, show_anim_func, hide_anim_func)
end

function SettingsView:initViews()
    popup_base.initViews(self)
 
    -- music
    local is_music_on = (UserData:getMusic() == 'on')

    local cb_music = self.csb_node:getChildByName('cb_music')
    cb_music:addEventListener(function(_, event_type)
        is_music_on = (event_type == ccui.CheckBoxEventType.selected)

        UserData:setMusic(is_music_on and 'on' or 'off')

        if is_music_on then
            Music:playMusic()
        else
            Music:stopMusic()
        end
    end)

    local music_slider = self.csb_node:getChildByName('slider_music')
    music_slider:addEventListener(function(slider, event_type)
        if event_type == ccui.SliderEventType.percentChanged then
            local value = slider:getPercent() / slider:getMaxPercent() 
            Music:setMusicValue(value)
        end
    end)
    music_slider:setPercent(tonumber(UserData:getMusicValue()) * 100)

    -- sound
    local is_sound_on = (UserData:getSound() == 'on')

    local cb_sound = self.csb_node:getChildByName('cb_sound')
    cb_sound:addEventListener(function(_, event_type)
        is_sound_on = (event_type == ccui.CheckBoxEventType.selected)

        UserData:setSound(is_sound_on and 'on' or 'off')
    end)

    local sound_slider = self.csb_node:getChildByName('slider_sound')
    sound_slider:addEventListener(function(slider, event_type)
        if event_type == ccui.SliderEventType.percentChanged then
            local value = slider:getPercent() / slider:getMaxPercent() 
            Music:setEffectValue(value)
        end
    end)
    sound_slider:setPercent(tonumber(UserData:getSoundValue()) * 100)

    -- button gps
    button('btn_gps_1', function() m_clientmain:get_instance():get_sdk_mgr():show_app_detail() end, self.csb_node)
    local btn_gps_2 = button('btn_gps_2', function() m_clientmain:get_instance():get_sdk_mgr():show_location_setting() end, self.csb_node)
    btn_gps_2:setVisible(device.platform ~= 'ios')

    -- button exit/continue game
    button('btn_exit_game', function()
        Msg:showMsgBox(2, '是否确定退出游戏？', function()
            self:onClose()
            m_clientmain:get_instance():logout_user_to_zserver()
            cc.Director:getInstance():endToLua()
            if device.platform == "ios" then os.exit() end
        end)
    end, self.csb_node)

    button('btn_continue_game', function() self:onClose() end, self.csb_node)

    -- button switch account
    button('btn_switch_account', function()
        Msg:showMsgBox(2, '是否确定切换账号？', function()
            UserData:set_weixin_openid(0)
            self:onClose()
            switchScene('app.platform.room.new_view.login_view')
        end)
    end, self.csb_node)

    button('btn_private', function() self.scene_instance:popupNode('app.platform.room.new_view.msg_box_9999', { title = '隐私政策', text = text_private }) end, self.csb_node)
    button('btn_service', function() self.scene_instance:popupNode('app.platform.room.new_view.msg_box_9999', { title = '服务条款', text = text_service }) end, self.csb_node)
end

return SettingsView
